#### ✅ Terraform Plan — `prod`

<details>
<summary>Show plan output</summary>

```
module.infrastructure.module.ckan_eks.module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.infrastructure.module.ckan_eks.module.cluster_autoscaler_irsa_role.data.aws_caller_identity.current: Reading...
module.infrastructure.module.ckan_eks.module.eks.data.aws_partition.current[0]: Reading...
module.infrastructure.module.ckan_eks.module.eks_dev_group.data.aws_caller_identity.current[0]: Reading...
module.infrastructure.module.ckan_eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.infrastructure.module.ckan_eks.module.eks.module.eks_managed_node_group["one"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.infrastructure.module.ckan_eks.module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.infrastructure.module.ckan_eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.infrastructure.module.ckan_eks.module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.infrastructure.module.ckan_eks.module.eks.module.eks_managed_node_group["one"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.infrastructure.module.ckan_eks.module.cluster_autoscaler_irsa_role.data.aws_caller_identity.current: Read complete after 0s [id=245948672511]
module.infrastructure.module.ckan_eks.module.eks.data.aws_caller_identity.current[0]: Reading...
module.infrastructure.module.ckan_eks.module.eks_dev_group.data.aws_partition.current: Reading...
module.infrastructure.module.ckan_eks.data.aws_iam_roles.admin_arn: Reading...
module.infrastructure.module.ckan_eks.module.eks_dev_group.data.aws_partition.current: Read complete after 0s [id=aws]
module.infrastructure.module.ckan_eks.module.cluster_autoscaler_irsa_role.data.aws_partition.current: Reading...
module.infrastructure.module.ckan_eks.module.eks_dev_group.data.aws_caller_identity.current[0]: Read complete after 0s [id=245948672511]
module.infrastructure.module.ckan_eks.module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.infrastructure.module.ckan_eks.module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=245948672511]
module.infrastructure.module.ckan_eks.module.cluster_autoscaler_irsa_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.infrastructure.module.ckan_eks.module.eks.data.aws_iam_session_context.current[0]: Reading...
module.infrastructure.module.ckan_eks.module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=245948672511]
module.infrastructure.module.ckan_eks.module.eks_dev_group.data.aws_iam_policy_document.iam_self_management: Reading...
module.infrastructure.module.ckan_eks.module.eks_dev_group.data.aws_iam_policy_document.iam_self_management: Read complete after 0s [id=3086397274]
module.infrastructure.module.ckan_eks.data.aws_iam_roles.admin_arn: Read complete after 0s [id=us-east-1]
module.infrastructure.module.ckan_eks.module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::245948672511:assumed-role/github-actions-oidc-role/GitHubActions]
module.infrastructure.module.ckan_eks.module.cluster_autoscaler_irsa_role.data.aws_iam_policy_document.cluster_autoscaler[0]: Reading...
module.infrastructure.module.ckan_eks.data.aws_eks_cluster_auth.default: Reading...
module.infrastructure.module.ckan_eks.module.cluster_autoscaler_irsa_role.data.aws_iam_policy_document.cluster_autoscaler[0]: Read complete after 0s [id=2612460398]
module.infrastructure.module.ckan_eks.data.aws_eks_cluster_auth.default: Read complete after 0s [id=ckan-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_dynamodb_table.tfm_state_lock will be created
  + resource "aws_dynamodb_table" "tfm_state_lock" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "tfm-state-lock"
      + read_capacity    = (known after apply)
      + region           = "us-east-1"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.infrastructure.module.ckan_ecr.aws_ecr_repository.odp-ecr["ckan-ecr"] will be created
  + resource "aws_ecr_repository" "odp-ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ckan-ecr"
      + region               = "us-east-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.infrastructure.module.ckan_ecr.aws_ecr_repository.odp-ecr["datapusher-ecr"] will be created
  + resource "aws_ecr_repository" "odp-ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "datapusher-ecr"
      + region               = "us-east-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.infrastructure.module.ckan_ecr.aws_ecr_repository.odp-ecr["frontend-ecr"] will be created
  + resource "aws_ecr_repository" "odp-ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "frontend-ecr"
      + region               = "us-east-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.infrastructure.module.ckan_eks.data.aws_iam_policy_document.csi will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "csi" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:ebs-csi-controller-sa",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.infrastructure.module.ckan_eks.data.tls_certificate.eks will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "eks" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.infrastructure.module.ckan_eks.aws_eks_access_entry.admin_role["arn:aws:iam::245948672511:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_AWSAdministratorAccess_69d61212ea5659d4"] will be created
  + resource "aws_eks_access_entry" "admin_role" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "ckan-prod"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::245948672511:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_AWSAdministratorAccess_69d61212ea5659d4"
      + region            = "us-east-1"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.infrastructure.module.ckan_eks.aws_eks_access_entry.admins will be created
  + resource "aws_eks_access_entry" "admins" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "ckan-prod"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = (known after apply)
      + region            = "us-east-1"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = "eks-admin"
    }

  # module.infrastructure.module.ckan_eks.aws_eks_access_policy_association.admin_policy["arn:aws:iam::245948672511:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_AWSAdministratorAccess_69d61212ea5659d4"] will be created
  + resource "aws_eks_access_policy_association" "admin_policy" {
      + associated_at = (known after apply)
      + cluster_name  = "ckan-prod"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::245948672511:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_AWSAdministratorAccess_69d61212ea5659d4"
      + region        = "us-east-1"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.infrastructure.module.ckan_eks.aws_eks_access_policy_association.admins will be created
  + resource "aws_eks_access_policy_association" "admins" {
      + associated_at = (known after apply)
      + cluster_name  = "ckan-prod"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = (known after apply)
      + region        = "us-east-1"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.infrastructure.module.ckan_eks.aws_eks_addon.csi_driver will be created
  + resource "aws_eks_addon" "csi_driver" {
      + addon_name               = "aws-ebs-csi-driver"
      + addon_version            = "v1.32.0-eksbuild.1"
      + arn                      = (known after apply)
      + cluster_name             = "ckan-prod"
      + configuration_values     = (known after apply)
      + created_at               = (known after apply)
      + id                       = (known after apply)
      + modified_at              = (known after apply)
      + region                   = "us-east-1"
      + service_account_role_arn = (known after apply)
      + tags_all                 = (known after apply)
    }

  # module.infrastructure.module.ckan_eks.aws_iam_role.eks_ebs_csi_driver will be created
  + resource "aws_iam_role" "eks_ebs_csi_driver" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-ebs-csi-driver"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.infrastructure.module.ckan_eks.aws_iam_role_policy_attachment.amazon_ebs_csi_driver will be created
  + resource "aws_iam_role_policy_attachment" "amazon_ebs_csi_driver" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
      + role       = "eks-ebs-csi-driver"
    }

  # module.infrastructure.module.ckan_eks.helm_release.ngnix_ingress will be created
  + resource "helm_release" "ngnix_ingress" {
      + atomic                     = false
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "nginx-ingress-production"
      + namespace                  = "nginx-ingress"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + set                        = [
          + {
              + name  = "rbac.create"
              + value = "true"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "controller.service.externalTrafficPolicy"
              + value = "Local"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "controller.publishService.enabled"
              + value = "true"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "controller.replicaCount"
              + value = "3"
                # (1 unchanged attribute hidden)
            },
        ]
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "4.15.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.infrastructure.module.ckan_eks.helm_release.sealed_secrets will be created
  + resource "helm_release" "sealed_secrets" {
      + atomic                     = false
      + chart                      = "sealed-secrets"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "sealed-secrets-controller"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "2.5.19"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.infrastructure.module.ckan_eks.kubectl_manifest.cluster_role will be created
  + resource "kubectl_manifest" "cluster_role" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "cluster-autoscaler"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                k8s-addon: cluster-autoscaler.addons.k8s.io
                k8s-app: cluster-autoscaler
              name: cluster-autoscaler
            rules:
            - apiGroups:
              - ""
              resources:
              - events
              - endpoints
              verbs:
              - create
              - patch
            - apiGroups:
              - ""
              resources:
              - pods/eviction
              verbs:
              - create
            - apiGroups:
              - ""
              resources:
              - pods/status
              verbs:
              - update
            - apiGroups:
              - ""
              resourceNames:
              - cluster-autoscaler
              resources:
              - endpoints
              verbs:
              - get
              - update
            - apiGroups:
              - ""
              resources:
              - nodes
              verbs:
              - watch
              - list
              - get
              - update
            - apiGroups:
              - ""
              resources:
              - namespaces
              - pods
              - services
              - replicationcontrollers
              - persistentvolumeclaims
              - persistentvolumes
              verbs:
              - watch
              - list
              - get
            - apiGroups:
              - extensions
              resources:
              - replicasets
              - daemonsets
              verbs:
              - watch
              - list
              - get
            - apiGroups:
              - policy
              resources:
              - poddisruptionbudgets
              verbs:
              - watch
              - list
            - apiGroups:
              - apps
              resources:
              - statefulsets
              - replicasets
              - daemonsets
              verbs:
              - watch
              - list
              - get
            - apiGroups:
              - storage.k8s.io
              resources:
              - storageclasses
              - csinodes
              - csidrivers
              - csistoragecapacities
              verbs:
              - watch
              - list
              - get
            - apiGroups:
              - batch
              - extensions
              resources:
              - jobs
              verbs:
              - get
              - list
              - watch
              - patch
            - apiGroups:
              - coordination.k8s.io
              resources:
              - leases
              verbs:
              - create
            - apiGroups:
              - coordination.k8s.io
              resourceNames:
              - cluster-autoscaler
              resources:
              - leases
              verbs:
              - get
              - update
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.infrastructure.module.ckan_eks.kubectl_manifest.cluster_role_binding will be created
  + resource "kubectl_manifest" "cluster_role_binding" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRoleBinding"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "cluster-autoscaler"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRoleBinding
            metadata:
              labels:
                k8s-addon: cluster-autoscaler.addons.k8s.io
                k8s-app: cluster-autoscaler
              name: cluster-autoscaler
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: ClusterRole
              name: cluster-autoscaler
            subjects:
            - kind: ServiceAccount
              name: cluster-autoscaler
              namespace: kube-system
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.infrastructure.module.ckan_eks.kubectl_manifest.deployment will be created
  + resource "kubectl_manifest" "deployment" {
      + api_version             = "apps/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Deployment"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "cluster-autoscaler"
      + namespace               = "kube-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                app: cluster-autoscaler
              name: cluster-autoscaler
              namespace: kube-system
            spec:
              replicas: 1
              selector:
                matchLabels:
                  app: cluster-autoscaler
              template:
                metadata:
                  labels:
                    app: cluster-autoscaler
                spec:
                  containers:
                  - command:
                    - ./cluster-autoscaler
                    - --v=4
                    - --stderrthreshold=info
                    - --cloud-provider=aws
                    - --skip-nodes-with-local-storage=false
                    - --expander=least-waste
                    - --node-group-auto-discovery=asg:tag=k8s.io/cluster-autoscaler/enabled,k8s.io/cluster-autoscaler/ckan-prod
                    image: registry.k8s.io/autoscaling/cluster-autoscaler:v1.32.3
                    name: cluster-autoscaler
                    resources:
                      limits:
                        cpu: 100m
                        memory: 600Mi
                      requests:
                        cpu: 100m
                        memory: 600Mi
                    volumeMounts:
                    - mountPath: /etc/ssl/certs/ca-certificates.crt
                      name: ssl-certs
                      readOnly: true
                  priorityClassName: system-cluster-critical
                  securityContext:
                    fsGroup: 65534
                    runAsNonRoot: true
                    runAsUser: 65534
                  serviceAccountName: cluster-autoscaler
                  volumes:
                  - hostPath:
                      path: /etc/ssl/certs/ca-bundle.crt
                    name: ssl-certs
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.infrastructure.module.ckan_eks.kubectl_manifest.role will be created
  + resource "kubectl_manifest" "role" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Role"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "cluster-autoscaler"
      + namespace               = "kube-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: Role
            metadata:
              labels:
                k8s-addon: cluster-autoscaler.addons.k8s.io
                k8s-app: cluster-autoscaler
              name: cluster-autoscaler
              namespace: kube-system
            rules:
            - apiGroups:
              - ""
              resources:
              - configmaps
              verbs:
              - create
              - list
              - watch
            - apiGroups:
              - ""
              resourceNames:
              - cluster-autoscaler-status
              - cluster-autoscaler-priority-expander
              resources:
              - configmaps
              verbs:
              - delete
              - get
              - update
              - watch
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.infrastructure.module.ckan_eks.kubectl_manifest.role_binding will be created
  + resource "kubectl_manifest" "role_binding" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "RoleBinding"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "cluster-autoscaler"
      + namespace               = "kube-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: RoleBinding
            metadata:
              labels:
                k8s-addon: cluster-autoscaler.addons.k8s.io
                k8s-app: cluster-autoscaler
              name: cluster-autoscaler
              namespace: kube-system
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: Role
              name: cluster-autoscaler
            subjects:
            - kind: ServiceAccount
              name: cluster-autoscaler
              namespace: kube-system
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.infrastructure.module.ckan_eks.kubectl_manifest.service_account will be created
  + resource "kubectl_manifest" "service_account" {
      + api_version             = (known after apply)
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = (known after apply)
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = (known after apply)
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = (known after apply)
      + yaml_incluster          = (sensitive value)
    }

  # module.infrastructure.module.ckan_storage.aws_s3_bucket.ckan_storage["ckan-dev-storage"] will be created
  + resource "aws_s3_bucket" "ckan_storage" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "ckan-dev-storage"
      + bucket_domain_name          = (known after apply)
      + bucket_namespace            = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.infrastructure.module.ckan_storage.aws_s3_bucket_public_access_block.ckan_storage_acl["ckan-dev-storage"] will be created
  + resource "aws_s3_bucket_public_access_block" "ckan_storage_acl" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = "ckan-dev-storage"
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + region                  = "us-east-1"
      + restrict_public_buckets = false
    }

  # module.infrastructure.module.ckan_vpc.aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "Security group for the RDS instance"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = "Allow traffic to the RDS instance"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
          + {
              + cidr_blocks      = [
                  + "50.35.55.238/32",
                ]
              + description      = "KennC IP"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "ckan_db"
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # module.infrastructure.module.ckan_eks.module.allow_assume_eks_admins_iam_policy.aws_iam_policy.policy[0] will be created
  + resource "aws_iam_policy" "policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM Policy"
      + id               = (known after apply)
      + name             = "allow-assume-eks-admin-iam-role"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.infrastructure.module.ckan_eks.module.allow_eks_access_iam_policy.aws_iam_policy.policy[0] will be created
  + resource "aws_iam_policy" "policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM Policy"
      + id               = (known after apply)
      + name             = "allow-eks-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "eks:DescribeCluster",
                          + "eks:ListClusters",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.infrastructure.module.ckan_eks.module.cert_manager.helm_release.cert_manager will be created
  + resource "helm_release" "cert_manager" {
      + atomic                     = false
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = (known after apply)
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + set                        = [
          + {
              + name  = "crds.enabled"
              + value = "true"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "crds.keep"
              + value = "true"
                # (1 unchanged attribute hidden)
            },
        ]
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.17.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.infrastructure.module.ckan_eks.module.cert_manager.kubectl_manifest.cluster_issuer[0] will be created
  + resource "kubectl_manifest" "cluster_issuer" {
      + api_version             = "cert-manager.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterIssuer"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "cert-manager"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = false
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: ClusterIssuer
            metadata:
              name: cert-manager
            spec:
              acme:
                email: test@email.com
                preferredChain: ISRG Root X1
                privateKeySecretRef:
                  name: cert-manager-private-key
                server: https://acme-v02.api.letsencrypt.org/directory
                solvers:
                - http01:
                    ingress:
                      class: nginx
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.infrastructure.module.ckan_eks.module.cert_manager.kubernetes_namespace.cert_manager[0] will be created
  + resource "kubernetes_namespace" "cert_manager" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + annotations      = {
              + "name" = "cert-manager"
            }
          + generation       = (known after apply)
          + name             = "cert-manager"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.ckan_eks.module.cert_manager.time_sleep.wait will be created
  + resource "time_sleep" "wait" {
      + create_duration = "60s"
      + id              = (known after apply)
    }

  # module.infrastructure.module.ckan_eks.module.cluster_autoscaler_irsa_role.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:cluster-autoscaler",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.infrastructure.module.ckan_eks.module.cluster_autoscaler_irsa_role.aws_iam_policy.cluster_autoscaler[0] will be created
  + resource "aws_iam_policy" "cluster_autoscaler" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Cluster autoscaler policy to allow examination and modification of EC2 Auto Scaling Groups"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "AmazonEKS_Cluster_Autoscaler_Policy-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "eks:DescribeNodegroup",
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "ec2:DescribeInstanceTypes",
                          + "autoscaling:DescribeTags",
                          + "autoscaling:DescribeScalingActivities",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeAutoScalingGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "autoscaling:UpdateAutoScalingGroup",
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                          + "autoscaling:SetDesiredCapacity",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "autoscaling:ResourceTag/kubernetes.io/cluster/ckan-prod" = "owned"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.infrastructure.module.ckan_eks.module.cluster_autoscaler_irsa_role.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cluster-autoscaler"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.infrastructure.module.ckan_eks.module.cluster_autoscaler_irsa_role.aws_iam_role_policy_attachment.cluster_autoscaler[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_autoscaler" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cluster-autoscaler"
    }

  # module.infrastructure.module.ckan_eks.module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.35"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.infrastructure.module.ckan_eks.module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.35"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.infrastructure.module.ckan_eks.module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.35"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.infrastructure.module.ckan_eks.module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/eks/ckan-prod/cluster"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + retention_in_days           = 90
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "prod"
          + "Name"        = "/aws/eks/ckan-prod/cluster"
        }
      + tags_all                    = {
          + "Environment" = "prod"
          + "Name"        = "/aws/eks/ckan-prod/cluster"
        }
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Environment"
      + region      = "us-east-1"
      + resource_id = (known after apply)
      + value       = "prod"
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "coredns"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-east-1"
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Environment" = "prod"
        }
      + tags_all                    = {
          + "Environment" = "prod"
        }

      + timeouts {}
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "kube-proxy"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-east-1"
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Environment" = "prod"
        }
      + tags_all                    = {
          + "Environment" = "prod"
        }

      + timeouts {}
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-east-1"
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Environment" = "prod"
        }
      + tags_all                    = {
          + "Environment" = "prod"
        }

      + timeouts {}
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = false
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + deletion_protection           = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "ckan-prod"
      + platform_version              = (known after apply)
      + region                        = "us-east-1"
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "Environment"           = "prod"
          + "terraform-aws-modules" = "eks"
        }
      + tags_all                      = {
          + "Environment"           = "prod"
          + "terraform-aws-modules" = "eks"
        }
      + version                       = "1.35"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = false
        }

      + compute_config (known after apply)

      + control_plane_scaling_config (known after apply)

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)

          + elastic_load_balancing (known after apply)
        }

      + storage_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Environment" = "prod"
          + "Name"        = "ckan-prod-eks-irsa"
        }
      + tags_all        = {
          + "Environment" = "prod"
          + "Name"        = "ckan-prod-eks-irsa"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_iam_policy.cluster_encryption[0] will be created
  + resource "aws_iam_policy" "cluster_encryption" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Cluster encryption policy to allow cluster role to utilize CMK provided"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "ckan-prod-cluster-ClusterEncryption"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "prod"
        }
      + tags_all         = {
          + "Environment" = "prod"
        }
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ckan-prod-cluster-"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "prod"
        }
      + tags_all              = {
          + "Environment" = "prod"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_iam_role_policy_attachment.additional["eks_vpccontroller"] will be created
  + resource "aws_iam_role_policy_attachment" "additional" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ckan-prod-cluster-"
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "prod"
          + "Name"        = "ckan-prod-cluster"
        }
      + tags_all               = {
          + "Environment" = "prod"
          + "Name"        = "ckan-prod-cluster"
        }
      + vpc_id                 = (known after apply)
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ckan-prod-node-"
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment"                     = "prod"
          + "Name"                            = "ckan-prod-node"
          + "kubernetes.io/cluster/ckan-prod" = "owned"
        }
      + tags_all               = {
          + "Environment"                     = "prod"
          + "Name"                            = "ckan-prod-node"
          + "kubernetes.io/cluster/ckan-prod" = "owned"
        }
      + vpc_id                 = (known after apply)
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-east-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_security_group_rule.node["egress_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + region                   = "us-east-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.infr

... (truncated)
```

</details>

*Triggered by @carloshdelreal in #9*